# Pandas Walkthrough

In [1]:
# We need to import Pandas & Numpy
import pandas as pd # pd is the alias
import numpy as np #np is the alias

### Basic forms -> Serie & Dataframe

In [2]:
my_dataframe = pd.DataFrame({
    'Name': ['Andres', 'Melissa', 'Freddy'],
    'Lastname': ['Gutierrez', 'Cardenas', 'Vega'],
    'Age': [23, 22, 35],
})
display(my_dataframe)

      Name   Lastname  Age
0   Andres  Gutierrez   23
1  Melissa   Cardenas   22
2   Freddy       Vega   35

In [3]:
# Get a column
my_dataframe['Name']

0     Andres
1    Melissa
2     Freddy
Name: Name, dtype: object

In [4]:
my_dataframe.Name # danger!

0     Andres
1    Melissa
2     Freddy
Name: Name, dtype: object

#### Simple query

In [5]:
my_dataframe[my_dataframe['Name'] == 'Andres']

     Name   Lastname  Age
0  Andres  Gutierrez   23

In [6]:
mask = [True, False, False]

In [7]:
my_dataframe[mask]

     Name   Lastname  Age
0  Andres  Gutierrez   23

In [8]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'], 
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [9]:
data.describe()

             one        two      three       four
count   4.000000   4.000000   4.000000   4.000000
mean    6.000000   7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978   5.163978
min     0.000000   1.000000   2.000000   3.000000
25%     3.000000   4.000000   5.000000   6.000000
50%     6.000000   7.000000   8.000000   9.000000
75%     9.000000  10.000000  11.000000  12.000000
max    12.000000  13.000000  14.000000  15.000000

In [10]:
data.loc['Ohio']

one      0
two      1
three    2
four     3
Name: Ohio, dtype: int32

In [11]:
data.iloc[0]

one      0
two      1
three    2
four     3
Name: Ohio, dtype: int32

In [12]:
data.iat[1,1]

5

In [13]:
data.at['Colorado', 'two']

5

In [14]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'), index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
display(df1, df2)

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [15]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [16]:
df2['sum'] = 0
df2

          b     d     e  sum
Utah    0.0   1.0   2.0    0
Ohio    3.0   4.0   5.0    0
Texas   6.0   7.0   8.0    0
Oregon  9.0  10.0  11.0    0

In [17]:
df2['sum'] = df2.apply(lambda x: x['b']+1, axis=1)

In [18]:
df2

          b     d     e   sum
Utah    0.0   1.0   2.0   1.0
Ohio    3.0   4.0   5.0   4.0
Texas   6.0   7.0   8.0   7.0
Oregon  9.0  10.0  11.0  10.0

In [19]:
df2['sum'] = df2.sum(axis=1)
df2

          b     d     e   sum
Utah    0.0   1.0   2.0   4.0
Ohio    3.0   4.0   5.0  16.0
Texas   6.0   7.0   8.0  28.0
Oregon  9.0  10.0  11.0  40.0

# Data Loading, Storage, and File Formats

### From CSV file

In [21]:
pd.read_csv("https://people.sc.fsu.edu/~jburkardt/data/csv/cities.csv").head()

,LatD,"""LatM""","""LatS""","""NS""","""LonD""","""LonM""","""LonS""","""EW""","""City""","""State"""
0,41,5,59,"""N""",80,39,0,"""W""","""Youngstown""",OH
1,42,52,48,"""N""",97,23,23,"""W""","""Yankton""",SD
2,46,35,59,"""N""",120,30,36,"""W""","""Yakima""",WA
3,42,16,12,"""N""",71,48,0,"""W""","""Worcester""",MA
4,43,37,48,"""N""",89,46,11,"""W""","""Wisconsin Dells""",WI

### Read from Excel File

In [24]:
pd.read_excel("./data/pokemon.xlsx", sheet_name="TypeChart").head()

   Attack   Defense Effectiveness  Multiplier
0  NORMAL    NORMAL        Normal         1.0
1  NORMAL      FIRE        Normal         1.0
2  NORMAL     WATER        Normal         1.0
3  NORMAL  ELECTRIC        Normal         1.0
4  NORMAL     GRASS        Normal         1.0

### Read from JSON

In [49]:
import requests as req
import json

In [67]:
pd.read_json(json.dumps(req.get("https://rickandmortyapi.com/api/character").json()['results'])).head()

,created,episode,gender,id,image,location,name,origin,species,status,type,url
0,2017-11-04T18:48:46.250Z,"[https://rickandmortyapi.com/api/episode/1, ht...",Male,1,https://rickandmortyapi.com/api/character/avat...,"{'name': 'Earth (Replacement Dimension)', 'url...",Rick Sanchez,"{'name': 'Earth (C-137)', 'url': 'https://rick...",Human,Alive,,https://rickandmortyapi.com/api/character/1
1,2017-11-04T18:50:21.651Z,"[https://rickandmortyapi.com/api/episode/1, ht...",Male,2,https://rickandmortyapi.com/api/character/avat...,"{'name': 'Earth (Replacement Dimension)', 'url...",Morty Smith,"{'name': 'Earth (C-137)', 'url': 'https://rick...",Human,Alive,,https://rickandmortyapi.com/api/character/2
2,2017-11-04T19:09:56.428Z,"[https://rickandmortyapi.com/api/episode/6, ht...",Female,3,https://rickandmortyapi.com/api/character/avat...,"{'name': 'Earth (Replacement Dimension)', 'url...",Summer Smith,"{'name': 'Earth (Replacement Dimension)', 'url...",Human,Alive,,https://rickandmortyapi.com/api/character/3
3,2017-11-04T19:22:43.665Z,"[https://rickandmortyapi.com/api/episode/6, ht...",Female,4,https://rickandmortyapi.com/api/character/avat...,"{'name': 'Earth (Replacement Dimension)', 'url...",Beth Smith,"{'name': 'Earth (Replacement Dimension)', 'url...",Human,Alive,,https://rickandmortyapi.com/api/character/4
4,2017-11-04T19:26:56.301Z,"[https://rickandmortyapi.com/api/episode/6, ht...",Male,5,https://rickandmortyapi.com/api/character/avat...,"{'name': 'Earth (Replacement Dimension)', 'url...",Jerry Smith,"{'name': 'Earth (Replacement Dimension)', 'url...",Human,Alive,,https://rickandmortyapi.com/api/character/5

## Read from Pickle